app/controllers/stores_controller.rb

INSERT INTO "stores" ("store_name", "location", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["store_name", "T-mall"], ["location", ""], ["description", ""], ["created_at", "2022-12-09 03:13:56.986461"], ["updated_at", "2022-12-09 03:13:56.986461"]]
---
    def create
        store = Store.create(store_params)